---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.IndexBuffer
source: html/2acc3aa5-9cfd-84ae-0f06-fdb89cb8c468.htm
---
# IndexBuffer Methods

Gets a stream that can be used to write IndexLine segment primitives into the buffer.